In [1]:
import pandas as pd

In [2]:
PATH = '../data'
df = pd.read_csv(f'{PATH}/customer_master_data.csv')

df.head()

,Unnamed: 0,Customer_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status
0,0,1000001,F,0-17,10,A,2,0
1,4,1000002,M,55+,16,C,4,0
2,5,1000003,M,26-35,15,A,3,0
3,6,1000004,M,46-50,7,B,2,1
4,9,1000005,M,26-35,20,A,1,1

In [3]:
column_to_drop = df.columns[0]
df = df.drop(columns=column_to_drop)

In [8]:
df.head()

,Customer_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status
0,1000001,F,0-17,10,A,2,0
1,1000002,M,55+,16,C,4,0
2,1000003,M,26-35,15,A,3,0
3,1000004,M,46-50,7,B,2,1
4,1000005,M,26-35,20,A,1,1